# Задание 1
# Создайте функцию-генератор countdown, которая выводит числа от 10 до 0.
# а) Опустошите генератор с помощью цикла б) Опустошите генератор с помощью next()
# подсказка: можно воспользоваться сочетанием цикла while и функцией next()

#под А
# def coutdown ():
#     for messi in range (10,-1,-1):
#         yield messi
# gen =coutdown()
# for pupsik in gen :
#     print (pupsik)
# #под Б
# def coutdown ():
#     for messi in range (10,-1,-1):
#         yield messi
# gen =coutdown()
# i = 0
# while i <11:
#     print (next (gen ))
#     i+=1